{
  "description": "DomoDucks (Indelibly) is a high-resolution complementation of the DomoDucks collection with each inscription averaging approximately 140000 bytes. Moreover, each of the 256 inscriptions contain precisely 256 colors and 256000 pixels! The collection drew inspiration from a series of 225 rubber-stamp prints by Andy Warhol. This series, entitled Purple Cows, depicted a 4×5 grid of 20 identical cow heads arranged on Rives paper and affixed to 8-7/16″×11-1/8″ sheets within a pop-art book entitled Stamped Indelibly. Correspondingly, DomoDucks (Indelibly) is composed of a series of 256 rubber-stamp prints that were originally depicted as a 3×4 grid of 12 identical duck heads arranged on 8-1/2″×11″ sheets. The underlying images over which the ink was manually hand-stamped were printed at 600 DPI to create a textured fabric-like appearance. And just as the fade-resistant pigments of the museum-quality archival inks imparted from the rubber stamps have been indelibly transferred and infused into the physical sheets of paper, their digitized high-resolution prints have also been indelibly inscribed on Fractal Bitcoin forever. Note: The first stamp in the collection is Inscription #5050, which is fitting because another set of 256 stamps with a new range of ink colors will be inscribed under it at a later date and airdropped to each holder so as to split the collection 50/50 between the early commemorative inscriptions (blocks 21000–22000) and the parent-child provenance inscriptions. Also, a limited-edition hardcover pop-art book entitled DomoDucks (Indelibly) will be published to showcase all 512 stamps. Only 88 copies will be produced, and each copy will include an 8″×10″ ready-to-frame presentation of some of the original physical stamp impressions replete with conservation quality matboard, backing, and bag (more details will be revealed at some point in the future).",
  "discord_link": "https://discord.gg/3wZuGxARVd",
  "icon": "https://live.staticflickr.com/65535/54001516635_d64f8c4965_o.gif",
  "name": "DomoDucks (Indelibly)",
  "slug": "domoducks-indelibly", 
  "twitter_link": "https://twitter.com/DomoDucks",
  "website_link": "https://domoducks.gitbook.io/domoducks/"
}
